Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: See also: sybase_connect(), sybase_pconnect().
pt_br: Veja também: sybase_connect(), sybase_pconnect().

source: A positive Sybase link identifier on success, or FALSE on error.
pt_br: Retorna: um identificador de recurso Sybase positivo em caso de sucesso ou um FALSE em caso de falha.

source: sybase_connect() establishes a connection to a Sybase server.
pt_br: sybase_connect() estabelece uma conexão com um servidor Sybase.

source: In case a second call is made to sybase_connect() with the same arguments, no new link will be established, but instead, the link identifier of the already opened link will be returned.
pt_br: Ao invés disto, o identificador de recurso do recurso já aberto será retornado.

source: The link to the server will be closed as soon as the execution of the script ends, unless it' s closed earlier by explicitly calling sybase_close().
pt_br: O recurso com o servidor será fechado tão logo a execução do script termine, a não ser que ele seja fechado anteriormente ao se chamar explicitamente o sybase_close().

source: See also sybase_pconnect(), sybase_close().
pt_br: Veja também sybase_pconnect(), sybase_close().

source: symlink() creates a symbolic link from the existing target with the specified name link.
pt_br: symlink() cria um link simbólico do alvo existente com o nome especificado em link.

source: See also link() to create hard links, and readlink() along with linkinfo().
pt_br: Veja também link() para criar hard links, e readlink() junto com linkinfo().

source: Table 1. syslog() Priorities (in descending order)
pt_br: Tabela 1. syslog() Priorities (in descending order)

source: Returns the hyperbolic tangent of arg, defined as sinh( arg) / cosh(arg).
pt_br: Retorna a tangente hiperbólica de arg, definida como sinh( arg) / cosh(arg).

source: See also tan(), atanh(), sin() and cos().
pt_br: Veja também tan(), atanh(), sin() e cos().

source: tan() returns the tangent of the arg parameter.
pt_br: tan() retorna a tangente do parâmetro arg.

source: See also atan(), sin(), cos() and deg2rad().
pt_br: Veja também atan(), sin(), cos() e deg2rad().

source: Creates a file with a unique filename in the specified directory.
pt_br: Descrição

source: If the directory does not exist, tempnam() may generate a file in the system's temporary directory, and return the name of that.
pt_br: Cria um nome de arquivo temporário único no diretório especificado.

source: Prior to PHP 4.0.6, the behaviour of the tempnam() function was system dependent.
pt_br: Retorna o nome gerado.

source: On Windows the TMP environment variable will override the dir parameter, on Linux the TMPDIR environment variable has precedence, while SVR4 will always use your dir On Windows the TMP environment variable will override the dir parameter, on Linux the TMPDIR environment variable has precedence, while SVR4 will always use your dir parameter if the directory it points to exists.
pt_br: No Windows a váriavel de ambiente do sistema TMP irá sobreescrever o parâmetro dir; no Linux a váriavel de ambiente TMPDIR tem precedência, enquanto SVR4 irá sempre usar o parâmetro dir se o diretório para o qual ele aponta existe.

source: Consult your system documentation on the tempnam( 3) function if in doubt.
pt_br: Consulte a documentação do seu sistema para a função tempnam( 3) na dúvida.

source: Returns the new temporary filename, or the FALSE string on failure.
pt_br: Retorna o nome do novo arquivo temporário, ou a string FALSE string em caso de erro.

source: Example 1. tempnam() example
pt_br: Exemplo 1. exemplo de tempnam()

source: $tmpfname = tempnam ("/ tmp", "FOO"); $handle = fopen($tmpfname, "w"); fwrite($handle, "writing to tempfile"); fclose($handle); / / do here something unlink($tmpfname);
pt_br: $tmpfname = tempnam ("/ tmp", "FOO"); $fp = fopen($tmpfname, "w"); fwrite($fp, "writing to tempfile"); fclose($fp); / / fazer alguma coisa unlink($tmpfname);

source: This function 's behavior changed in 4.0.3.
pt_br: O comportamento desta função mudou na versão 4.0.3.

source: The temporary file is also created to avoid a race condition where the file might appear in the filesystem between the time the string was generated and before the the script gets around to creating the file.
pt_br: O arquivo temporário é também criado para evitar uma condição de corrida (race) onde o arquivo pode aparecer no filesystem entre o tempo que a string foi gerada e antes que o script tem tempo para criar o arquivo.

source: Note, that you need to remove the file in case you need it no more, it is not done automatically.
pt_br: Note que você precisa remover o arquivo caso não vá mais utilizá-lo, pois isso não é feito automaticamente.

source: See also tmpfile() and unlink().
pt_br: Veja também tmpfile() e unlink().

source: Returns the current time measured in the number of seconds since the Unix Epoch (January 1 1970 00:00:00 GMT).
pt_br: Retorna a hora atual medida no número de segundos desde a Era Unix (January 1 1970 00:00:00 GMT).

source: See also date().
pt_br: Veja também date().

source: Creates a temporary file with an unique name in write mode, returning a file handle similar to the one returned by fopen().
pt_br: Cria um arquivo temporário com um nome único em modo de gravação, retornando o handle do arquivo em modo similar ao retornado por fopen().

source: The file is automatically removed when closed (using fclose()), or when the script ends.
pt_br: O arquivo é automáticamente apagado quando fechado (usando fclose()), ou quando o script acaba.

source: For details, consult your system documentation on the tmpfile( 3) function, as well as the stdio.h header file.
pt_br: Para detalhes consulte a documentação do seu sistem na função tmpfile( 3), assim como o header stdio.h.

source: Example 1. tmpfile() example
pt_br: Exemplo 1. exemplo de tmpfile()

source: $temp = tmpfile(); fwrite($temp, "writing to tempfile"); fclose($temp); / / this removes the file
pt_br: $temp = tmpfile(); fwrite($temp, "escrevendo no arquivo temporario"); fclose($temp); / / isto remove o arquivo

source: See also tempnam().
pt_br: Veja também tempnam().

source: Attempts to set the access and modification time of the file named by filename to the value given by time.
pt_br: Tenta mudar o tempo de acesso e modificação do arquivo filename para o valor informado em time.

source: If the option time is not given, uses the present time.
pt_br: Se a opção time não é informada, o hora atual será usado.

source: This is equivalent to what utime (sometimes referred to as utimes) does.
pt_br: Isto é o equivalente ao que comando (Unix) utime faz.

source: If the third option atime is present, the access time of the given filename is set to the value of atime.
pt_br: Se a terceira opção atime for passada, o tempo de acesso do arquivo informado será modificado para o valor de atime.

source: Note that the access time is always modified, regardless of the number of parameters.
pt_br: Note que a data / hora do último acesso do arquivo sempre é alterado, independentemente do número de parâmetros.

source: If the file does not exist, it is created.
pt_br: Se o arquivo não existe, ele é criado.

source: Example 1. touch() example
pt_br: Exemplo 1. exemplo da função touch()

source: if (touch ($FileName)) {print "$FileName modification time has been changed to todays date and time";} else {print "Sorry Could Not change modification time of $FileName";}
pt_br: if (touch ($nomedoarquivo)) {print "o tempo do $nomedoarquivo foi modificado para o dia e hora de atuais";} else {print "Desculpe, não foi possivel modificar o tempo de $nomedoarquivo";}

source: The optional charlist parameter was added in PHP 4.1.0
pt_br: Nota:

source: The comparison function is user-defined.
pt_br: A função de comparacão é definida pelo usuário.

source: Please see usort() and uksort() for examples of user-defined comparison functions.
pt_br: Por favor, veja usort() e uksort() para exemplos de funções de comparação definidas pelo usuário.

source: See also usort(), uksort(), sort(), asort(), arsort(), ksort(), and rsort().
pt_br: Veja também usort(), uksort(), sort(), asort(), arsort(), ksort() e rsort().

source: Example 1. ucfirst() example
pt_br: Exemplo 1. ucfirst() example

source: Example 1. ucwords() example
pt_br: Exemplo 1. ucwords() example

source: udm_api_version() returns mnoGoSearch API version number.
pt_br: Description

source: udm_free_ispell_data() always returns TRUE.
pt_br: Description

source: udm_load_ispell_data() loads ispell data.
pt_br: Description

source: This function will sort the keys of an array using a user-supplied comparison function.
pt_br: Essa função irá ordenar as chaves de um array usando uma função de comparação definida pelo usuário.

source: If the array you wish to sort needs to be sorted by some non-trivial criteria, you should use this function.
pt_br: Se o array precisa ser classificado utilizando um critério não trivial, você deve usar essa função.

source: Example 1. uksort() example
pt_br: Exemplo de uksort()

source: 1;} $a = array (4 = "four", 3 = "three", 20 = "twenty", 10 = "ten"); uksort ($a, "cmp"); while (list ($key, $value) = each ($a)) {echo "$key: $value\n";}
pt_br: 1;} $a = array (4 = "quatro", 3 = "tres", 20 = "vinte", 10 = "dez"); uksort ($a, "cmp"); while (list ($chave, $valor) = each ($a)) {echo "$chave: $valor\n";}

source: 20: twenty 10: ten 4: four 3: three
pt_br: 20: vinte 10: dez 4: quatro 3: tres

source: See also usort(), uasort(), sort(), asort(), arsort(), ksort(), natsort(), and rsort().
pt_br: Veja também usort(), uasort(), sort(), asort(), arsort(), ksort(), natsort() e rsort().

source: umask() sets PHP's umask to mask 0777 and returns the old umask.
pt_br: umask() modifica o umask do PHP para o mask 0777 e retorna o umask antigo.

source: When PHP is being used as a server module, the umask is restored when each request is finished.
pt_br: Quando o PHP está sendo utilizado como um módulo do servidor, o umask é restaurado ao final de cada pedido.

source: umask() without arguments simply returns the current umask.
pt_br: umask() sem argumentos simplesmente retorna o umask atual.

source: uniqid() returns a prefixed unique identifier based on the current time in microseconds.
pt_br: uniqid() retorna um identificador unico prefixado baseado no tempo atual em milionésimos de segundo.

source: The prefix can be useful for instance if you generate identifiers simultaneously on several hosts that might happen to generate the identifier at the same microsecond.
pt_br: O Prefixo pode ser usado se você gera identificadores em vários servidores simultaneamente pode acontecer de gerar o identificador no mesmo milionésimo de segundo.

source: Prefix can be up to 114 characters long.
pt_br: Prefix pode ter até 114 caracteres.

source: If the optional lcg parameter is TRUE, uniqid() will add additional "combined LCG "entropy at the end of the return value, which should make the results more unique.
pt_br: Se o parâmetro lcg, que é opcional, for TRUE, uniqid() irá adicionar a entropia "LCG combinada "ao final do valor retornado, o que deve fazer o resultado mais unico.

source: With an empty prefix, the returned string will be 13 characters long.
pt_br: Com o parâmetro prefix Com o parâmetro prefix vazio, a string retornada terá 13 caracteres.

source: If lcg is TRUE, it will be 23 characters.
pt_br: Se o parâmetro lcg for TRUE, terá 23 caracteres.

source: The lcg parameter is only available in PHP 4 and PHP 3.0.13 and later.
pt_br: O parâmetro lcg somente esta disponivel no PHP 4 e PHP 3.0.13 e posterior.

source: If you need a unique identifier or token and you intend to give out that token to the user via the network (i.e. session cookies), it is recommended that you use something along the lines of
pt_br: Se você precisa um identificador unico e pretende dar o seu identificador via rede( ex. cookies de seção), é recomendado que você use algo como

source: $token = md5( uniqid("")); / / no prefix $better_token = md5(uniqid(rand(),1)); / / better, difficult to guess
pt_br: $token = md5( uniqid("")); / / sem prefixo $better_token = md5(uniqid(rand(),1)); / / melhor, dificil de adivinhar

source: This will create a 32 character identifier (a 128 bit hex number) that is extremely difficult to predict.
pt_br: Isto irá criar um identificador de 32 caracteres( a 128 bit hex number) que é extremamente dificil de prever.

source: Deletes filename.
pt_br: Descrição

source: Similar to the Unix C unlink() function.
pt_br: Similar a função C no Unix unlink().

source: See also rmdir() for removing directories.
pt_br: Veja também rmdir() para remover diretórios.

source: Example 1. unpack() format string
pt_br: Exemplo 1. unpack() format string

source: Example 1. unserialize_callback_func example
pt_br: Exemplo 1. unserialize_callback_func example

source: Example 2. unserialize() example
pt_br: Exemplo 2. unserialize() example

source: unset() destroys the specified variables.
pt_br: Description

source: Example 1. unset() example
pt_br: Exemplo 1. unset() example

source: Decodes any% ## encoding in the given string.
pt_br: Descrição

source: The decoded string is returned.
pt_br: Decodifica qualquer% ## codificado na string.

source: Example 1. urldecode() example
pt_br: A string decodificada é o valor de retorno.

source: $a = explode( '', $QUERY_STRING); $i = 0; while ($i count($a)) {$b = split('=', $a[$i]); echo'Value for parameter ', htmlspecialchars(urldecode($b[0])),' is', htmlspecialchars(urldecode($b[1])), "br / \n"; $i++;}
pt_br: $a = split ('', $querystring); $i = 0; while ($i count ($a)) {$b = split ('=', $a [$i]); echo 'Value for parameter ', htmlspecialchars (urldecode ($b [0])),' is ', htmlspecialchars (urldecode ($b [1])), "BR"; $i++;}

source: See also urlencode(), rawurlencode(), rawurldecode().
pt_br: Veja também urlencode().

source: This differs from the RFC1738 encoding (see rawurlencode()) in that for historical reasons, spaces are encoded as plus (+) signs.
pt_br: Description

source: Example 1. urlencode() example
pt_br: Retorna uma string onde todos caracteres não-alfanuméricos exceto -_. é substituido por um sinal de porcento (%) seguidos por dois digítos hexadecimais e espaços codificados como um sinal de 'mais '(+).

source: Things like amp, copy and pound are parsed by the browser and the actual entity is used instead of the desired variable name.
pt_br: É codificando o mesmo caminho que um dado enviados por um formulário WWW é codificado, que é a mesma coisa como em um tipo de mídia application / x-www-form-urlencoded.

source: The reference is here: http: / /www.w3.org / TR / html4 / appendix / notes.html#h-B.2.2 The reference is here: http: / /www.w3.org / TR / html4 / appendix / notes.html#h-B.2.2 PHP supports changing the argument separator to the W3C-suggested semi-colon through the arg_separator .ini directive.
pt_br: Isto difere da codificação RFC1738 (veja rawurlencode()) por rasões históricas, espaçoes são codificados como um sinal de 'mais '(+).

source: A more portable way around this is to use amp; instead of as the separator.
pt_br: Esta função é conveniente quando codificado uma string para ser usada em uma parte de consulta em uma URL, como um conveniente meio de passar variáveis para uma próxima página:

source: Leave it as, but simply encode your URLs using htmlentities() (urlencode($data)).
pt_br: Exemplo 1. urlencode() exemplo

source: echo 'a href="mycgi?foo=', htmlentities(urlencode($userinput)),' "';
pt_br: echo 'A HREF="mycgi?foo=', urlencode ($userinput),' "';

source: See also urldecode(), htmlentities(), rawurldecode(), rawurlencode().
pt_br: Veja também urldecode().

source: This is an alias for the function trigger_error().
pt_br: Description

source: A microsecond is one millionth of a second.
pt_br: A função usleep() atrasa a execução do programa para o número dado no parâmetro micro_seconds em milionésimos de segundo.

source: See also sleep() and set_time_limit().
pt_br: Veja também sleep() e set_time_limit().

source: This function will sort an array by its values using a user-supplied comparison function.
pt_br: Essa função irá ordenar um array pelos valores usando uma função de classificação definida pelo usuário.

source: The comparison function must return an integer less than, equal to, or greater than zero if the first argument is considered to be respectively less than, equal to, or greater than the second.
pt_br: A função de comparação deve retornar um inteiro menor, igual ou maior que zero se o primeiro argumento for considerado respectivamente menor, igual, ou maior que o segundo.

source: If two members compare as equal, their order in the sorted array is undefined.
pt_br: Se dois elementos são considerados iguais, a ordem deles fica indefinida no array resultante.

source: Up to PHP 4.0.6 the user defined functions would keep the original order for those elements, but with the new sort algorithm intruduced with 4.1.0 this is no longer the case as there is no solution to do so in an efficient way.
pt_br: Até o PHP 4.0.6 as funções definidas pelo usuário manteriam a ordem original desses elementos, mas com o novo algoritmo de ordenação introduzido no 4.1.0 esse não é o caso, pois não existe solução para fazer isso de modo eficiente.

source: Example 1. usort() example
pt_br: Exemplo de usort()

source: 1;} $a = array (3, 2, 5, 6, 1); usort ($a, "cmp"); while (list ($key, $value) = each ($a)) {echo "$key: $value\n";}
pt_br: 1;} $a = array (3, 2, 5, 6, 1); usort ($a, "cmp"); while (list ($chave, $valor) = each ($a)) {echo "$chave: $valor\n";}

source: Obviously in this trivial case the rsort() function would be more appropriate.
pt_br: Obviamente que nesse caso trivial a função rsort() seria mais apropriada.

source: Example 2. usort() example using multi-dimensional array
pt_br: Exemplo de usort() usando um array multi-dimensional

source: function cmp ($a, $b) {return strcmp($a["fruit"], $b["fruit"]);} $fruits[0]["fruit"] = "lemons"; $fruits[1]["fruit"] = "apples"; $fruits[2]["fruit"] = "grapes"; usort($fruits, "cmp"); while (list ($key, $value) = each ($fruits)) {echo "\$fruits[$key]: ". $value["fruit"]. "\n";}
pt_br: function cmp ($a, $b) {return strcmp($a["fruta"], $b["fruta"]);} $frutas[0]["fruta"] = "limoes"; $frutas[1]["fruta"] = "abacaxis"; $frutas[2]["fruta"] = "goiabas"; usort($frutas, "cmp"); while (list ($chave, $valor) = each ($frutas)) {echo "\$frutas[$chave]: ". $valor["fruta"]. "\n";}

source: When sorting a multi-dimensional array, $a and $b contain references to the first index of the array.
pt_br: Na ordenação de um array multi-dimensional, $a e $b contêm referências para o primeiro índice do array.

source: $fruits[ 0]: apples $fruits[1]: grapes $fruits[2]: lemons
pt_br: Nota:

source: Example 3. usort() example using a member function of an object
pt_br: Exemplo 3.

source: class TestObj {var $name; function TestObj($name) {$this - name = $name;} / * This is the static comparing function: * / function cmp_obj($a, $b) {$al = strtolower($a - name); $bl = strtolower($b - name); if ($al == $bl) return 0; return ($al $bl)? +1: -1;}} $a[] = new TestObj("c"); $a[] = new TestObj("b"); $a[] = new TestObj("d"); uasort($a, array ("TestObj", "cmp_obj")); foreach ($a as $item) {print $item - name ."\n";}
pt_br: class TestObj {var $name; function TestObj($name) {$this - name = $name;} / * Essa é a função estática de comparação * / function cmp_obj($a, $b) {$al = strtolower($a - name); $bl = strtolower($b - name); if ($al == $bl) return 0; return ($al $bl)? +1: -1;}} $a[] = new TestObj("c"); $a[] = new TestObj("b"); $a[] = new TestObj("d"); uasort($a, array ("TestObj", "cmp_obj")); foreach ($a as $item) {print $item - name ."\n";}

source: See also uasort(), uksort(), sort(), asort(), arsort(), ksort(), natsort(), and rsort().
pt_br: Veja também uasort(), uksort(), sort(), asort(), arsort(), ksort(), natsort(), e rsort().

source: Example 1. var_dump() example
pt_br: Exemplo 1. var_dump() example

source: Example 1. version_compare() Example
pt_br: Exemplo 1. version_compare() Example

source: virtual() is an Apache-specific function which is equivalent to !--#include virtual...- - in mod_include.
pt_br: virtual() é uma função específica do Apache que é equivalente a !--#include virtual...- - no mod_include.

source: It performs an Apache sub-request.
pt_br: Ela realiza uma sub-requisição do Apache.

source: It is useful for including CGI scripts or .shtml files, or anything else that you would parse through Apache.
pt_br: Ela é útil para incluir scripts de CGI ou arquivos .shtml, ou qualquer outra coisa que você possa analisar através do Apache.

source: Note that for a CGI script, the script must generate valid CGI headers.
pt_br: Note que para um script CGI, o script precisa gerar um cabeçalho CGI válido.

source: At the minimum that means it must generate a Content-type header.
pt_br: Isto significa que, no mínimo, ele precisa gerar um cabeçalho Content-type.

source: For PHP files, you need to use include() or require(); virtual() cannot be used to include a document which is itself a PHP file.
pt_br: Para arquivos PHP, você precisa usar include() ou require(). virtual() não pode ser usado para incluir um documento que é um arquivo PHP.

source: To run the sub-request, all buffers are terminated and flushed to the browser, pending headers are sent too.
pt_br: Headers pendentes são enviados também.

source: (4.2.0 - 4.2.3 only)
pt_br: w32api_deftype

source: Example 1. wddx_serialize_vars() example
pt_br: Exemplo 1. wddx_serialize_vars() example

source: Example 1. wordwrap() example
pt_br: Exemplo 1. wordwrap() example

source: Example 2. wordwrap() example
pt_br: Exemplo 2. wordwrap() example

source: An error code from xml_get_error_code().
pt_br: Description

source: A reference to the XML parser to get byte index from.
pt_br: Description

source: A reference to the XML parser to get column number from.
pt_br: Description

source: A reference to the XML parser to get line number from.
pt_br: Description

source: A reference to the XML parser to get error code from.
pt_br: Description

source: A reference to the XML parser to use.
pt_br: Description

source: Example 1. moldb.xml - small database of molecular information
pt_br: Exemplo 1. moldb.xml - small database of molecular information

source: Example 2. parsemoldb.php - parses moldb.xml into and array of molecular objects
pt_br: Exemplo 2. parsemoldb.php - parses moldb.xml into and array of molecular objects

source: Which character encoding the parser should use.
pt_br: Description

source: A reference to the XML parser to free.
pt_br: Description

source: A reference to the XML parser to get an option from.
pt_br: Description

source: Instead of a function name, an array containing an object reference and a method name can also be supplied.
pt_br: Ao invés de um nome de função, um array contendo uma referência de objeto e ao nome de método também pode ser fornecidos.

source: This function allows to use parser inside object.
pt_br: Description

source: Set the output encoding for the XSLT transformations.
pt_br: Description

source: A reference to the XSLT parser.
pt_br: Description

source: (4.0.3 - 4.0.6 only)
pt_br: xslt_set_sax_handler

source: Set SAX handlers on the resource handle given by xh.
pt_br: Description

source: (4.0.5 - 4.0.6 only)
pt_br: xslt_set_scheme_handler

source: Set Scheme handlers on the resource handle given by xh.
pt_br: Description

source: This function invokes a CCL parser.
pt_br: Description

source: Closes connection given by id.
pt_br: Description

source: This function sets the element set name for retrieval.
pt_br: Description

source: Returns error for target (last request).
pt_br: Description

source: Returns error text message for target (last request).
pt_br: Description
